uhnp/src/Catalogs/ДокументыБД/ДокументыБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДокументыБД</name>
  <comment>Содержит реквизиты, необходимые для выборки данных из текущей и внешних информационных баз</comment>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ТипыБазДанных</owners>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиОбменаДокументами</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьПриНеудачномПоискеПриИмпорте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьРеквизитыПриИмпорте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВПроцессе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокументаБД</name>
    <type>
      <types>EnumRef.ТипыДокументовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонДокументаБД</name>
    <type>
      <types>DefinedType.ШаблонДокументаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитСостояния</name>
    <type>
      <types>CatalogRef.ПеречисленияБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеРеквизитаСостоянияЧерновик</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеРеквизитаСостоянияНаУтверждении</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеРеквизитаСостоянияУтвержден</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеРеквизитаСостоянияОтклонен</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьШаблоны</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитШаблонаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДляАналитики1УП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДляАналитики2УП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДляАналитики3УП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВНастройкахРеглмента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПравилоРасчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПравилоПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьБланк</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСпособФормирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьУниверсальныйИмпорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьШаблонТрансляции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчастокУчета</name>
    <type>
      <types>CatalogRef.УчасткиУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитСостоянияСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитРазделенияПоПроектам</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитРазделенияПоОрганизациям</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитКонтрагент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДоговорКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитСуммыДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеБлокироватьРеквизитыПриУтверждении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_НеОтражатьВУУ</name>
    <comment>// Гутарова Екатерина 03.05.2023 Выполнение задач №000045368</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Синоним1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Синоним2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбязателенКомментарий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласуетсяВДокументообороте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Реквизиты</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьДляСогласования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Отображать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАналитики</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеПримитивногоТипа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним1</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним2</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДопРеквизитыМатрицыПроцесса</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьДоступныеФормыСхемРеквизитов</name>
    <attributes>
      <name>ИмяДоступнойФормы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеФормыСхемРеквизитов</name>
    <attributes>
      <name>ИмяДоступнойФормы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Enums/ТипыДокументовБД/ТипыДокументовБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДокументовБД</name>
  <enumValues>
    <name>ВидОтчета</name>
  </enumValues>
  <enumValues>
    <name>ОбратноеРаспределение</name>
  </enumValues>
  <enumValues>
    <name>РучнаяКорректировка</name>
  </enumValues>
  <enumValues>
    <name>Трансляция</name>
  </enumValues>
  <enumValues>
    <name>ТрансформационнаяКорректировка</name>
  </enumValues>
  <enumValues>
    <name>ПериодическийДокумент</name>
  </enumValues>
  <enumValues>
    <name>ПрочийДокумент</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СостоянияСогласования/СостоянияСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияСогласования</name>
  <enumValues>
    <name>Отклонено</name>
  </enumValues>
  <enumValues>
    <name>Рассматривается</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>НаУтверждении</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Возвращена</name>
  </enumValues>
  <enumValues>
    <name>УдалитьНаОплате</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОплачено</name>
  </enumValues>
  <enumValues>
    <name>УдалитьНеактивен</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СостоянияОтчетов/СостоянияОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОтчетов</name>
  <enumValues>
    <name>Запланирован</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>Возвращен</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>ЗаписанСОшибкой</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ПлатформыВнешнихИнформационныхБаз/ПлатформыВнешнихИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПлатформыВнешнихИнформационныхБаз</name>
  <enumValues>
    <name>Предприятие8</name>
  </enumValues>
  <enumValues>
    <name>Предприятие81</name>
  </enumValues>
  <enumValues>
    <name>Предприятие77</name>
  </enumValues>
  <enumValues>
    <name>Предприятие82</name>
  </enumValues>
  <enumValues>
    <name>Предприятие83</name>
  </enumValues>
  <enumValues>
    <name>ADO</name>
    <comment>Работа с внешними информационными базами через ADO</comment>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ТипыБазДанных/ТипыБазДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыБазДанных</name>
  <predefined>
    <items>
      <name>ТекущаяИБ</name>
      <description>Текущая информационная база</description>
    </items>
    <items>
      <name>ОбменТаблДок</name>
      <description>Файлы Microsoft Excel</description>
    </items>
  </predefined>
  <attributes>
    <name>ВИБПоУмолчанию</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>EnumRef.ПлатформыВнешнихИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПоУмолчанию</name>
    <comment>Если при сопоставлении получено пустое значение валюты, тогда подставить значение валюты по умолчанию</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменДаннымиРегламентнымЗаданием</name>
    <comment>Выполнять данными контроля НСИ регламентным заданием</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьНСИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуютсяПланыОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеВидовСубконто</name>
    <attributes>
      <name>ВидСубконтоИБ</name>
      <type>
        <types>ChartOfCharacteristicTypesRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидАналитики</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/ПеречисленияБД/ПеречисленияБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПеречисленияБД</name>
  <comment>Содержит реквизиты, необходимые для работы с перечислениями текущей или внешних информационных баз</comment>
  <owners>Catalog.ТипыБазДанных</owners>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Синоним1</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Синоним2</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Реквизиты</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним1</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним2</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/ДокументыБД/ObjectModule.bsl
Перем Используется77; // Признак использования обращения к ВИБ на платформе 7.7
Перем ТекСоединениеВИБ Экспорт; // Текущее соединение с внешней информационной базой
Перем ДокументБД;
Перем ТекущаяИБ;
Перем мОписаниеТиповСтрока;
Перем мОписаниеТиповБулево;
Перем мОписаниеТиповТЗ;
Перем мОписаниеТиповСписокЗначений;

Перем ТаблицаРеквизитовКонсолидации;
Перем ТаблицаРеквизитовВИБ;
Перем ТекТаблицаСинхронизации;


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ЗаполнитьРеквизитыОбъекта(Кэш = Неопределено, ЕстьИзменения = Истина) Экспорт
	
	Если Не ПроверитьНаименование() Тогда	
		Возврат;	
	КонецЕсли;
	
	ТекущаяИБ = (Владелец = Справочники.ТипыБазДанных.ТекущаяИБ);
	ПолеСиноним=РаботаСОбъектамиМетаданныхУХ.ПолучитьПолеСиноним();
	
	Если НЕ ТекущаяИБ Тогда
		
		Если ТекСоединениеВИБ = Неопределено Тогда
			
			ТекСоединениеВИБ = ОбщегоНазначенияУХ.ПолучитьСоединениеСВИБПоУмолчанию(Владелец, 1);
			
			Если ТекСоединениеВИБ = Неопределено Тогда
				
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ТекСоединениеВИБ = РаботаСОбъектамиМетаданныхУХ.КонтекстМетаданных();
		
	КонецЕсли;
	
	РеквизитыДоОбновления = Реквизиты.Выгрузить();
	
	СтруктураОписания = РаботаСОбъектамиМетаданныхУХ.ПолучитьСтруктуруОписанияДокументаБД(Наименование, ТекСоединениеВИБ, 
	Использование77(), Кэш);
	
	Если СтруктураОписания.Свойство("ТекстОшибки") Тогда
		
		ОбщегоНазначенияУХ.СообщитьОбОшибке(СтруктураОписания.ТекстОшибки,Истина,,СтатусСообщения.Внимание);
		Возврат;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСерверУХ.УстановитьНовоеЗначение(ЭтотОбъект[ПолеСиноним], СтруктураОписания.Синоним, ЕстьИзменения);
	РаботаСОбъектамиМетаданныхУХ.ЗаполнитьИзмененныеРеквизиты(ЭтотОбъект, СтруктураОписания, "Реквизиты,Синоним", ЕстьИзменения);
	
	ТабНовыеРеквизиты = ЭтотОбъект.Реквизиты.ВыгрузитьКолонки();
	Для Каждого СтрРеквизит ИЗ СтруктураОписания.Реквизиты Цикл
		
		НоваяСтрока = ТабНовыеРеквизиты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрРеквизит,,"Синоним");
		НоваяСтрока[ПолеСиноним]=СтрРеквизит.Синоним;
		
		ВосстановитьДанныеРеквизитов(НоваяСтрока, РеквизитыДоОбновления,ПолеСиноним);
		
	КонецЦикла;	
	
	РаботаСОбъектамиМетаданныхУХ.ЗагрузитьИзмененнуюТабЧасть(ЭтотОбъект.Реквизиты, ТабНовыеРеквизиты, ЕстьИзменения);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		РаботаСОбъектамиМетаданныхУХ.ОбновитьОписаниеТабличнойЧастиБД(ТекСоединениеВИБ, Ссылка, 
		Новый Структура("ТипОбъектаМетаданных,ИмяОбъектаМетаданных","Documents",Наименование),
		Использование77(),
		Кэш);
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьРеквизитыОбъекта()

Функция ВосстановитьДанныеРеквизитов(СтрокаРеквизита,СохраненныеДанные,ПолеСиноним)
	
	СохраненнаяСтрока=СохраненныеДанные.Найти(СтрокаРеквизита.Имя,"Имя");
	
	Если НЕ СохраненнаяСтрока=Неопределено Тогда
		
		ЗаполнитьЗначенияСвойств(СтрокаРеквизита,СохраненнаяСтрока,,ПолеСиноним+",ТипДанных,ОписаниеПримитивногоТипа");
		
	КонецЕсли;
	
КонецФункции // ВосстановитьДанныеРеквизитов() 

Функция ПроверитьНаименование(Отказ = Ложь)
	
	Если ЗначениеЗаполнено(Наименование) Тогда
		Возврат Истина;
	Иначе
		ОбщегоНазначенияУХ.СообщитьОбОшибке(НСтр("ru = 'Для обрабатываемого плана счетов внешней информационной базы не указано наименование.'"),Отказ,,СтатусСообщения.Внимание);
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипДокументаБД.Пустая() Тогда
		ТипДокументаБД = ПредопределенноеЗначение("Перечисление.ТипыДокументовБД.ПрочийДокумент");
	КонецЕсли;
	
	Если РазделятьПоОрганизациям и РеквизитРазделенияПоОрганизациям="" Тогда
		ОбщегоНазначенияУХ.СообщитьОбОшибке(НСтр("ru = 'Выбрано разделение ответственных по организациям. Необходимо указать реквизит, соответствующий организации.'"), Отказ,, СтатусСообщения.Внимание);
	КонецЕсли;
	Если РазделятьПоПроектам и РеквизитРазделенияПоПроектам="" Тогда
		ОбщегоНазначенияУХ.СообщитьОбОшибке(НСтр("ru = 'Выбрано разделение ответственных по проектам. Необходимо указать реквизит, соответствующий проекту.'"), Отказ,, СтатусСообщения.Внимание);
	КонецЕсли;
	
	ПроверитьНаименование(Отказ);
	
	Если ЗначениеЗаполнено(ШаблонДокументаБД) Тогда
		Если НЕ Синоним = Наименование Тогда
			Синоним = Наименование;
		КонецЕсли;
	КонецЕсли;
	
	Если РеквизитШаблонаДокумента="Сценарий" или РеквизитШаблонаДокумента="ПериодОтчета" Или РеквизитШаблонаДокумента="Организация" Тогда
		
		СтрокаШаблона = НСтр("ru = 'Реквизит %1 не может быть использован в качестве шаблона!'");
		
		Если Не ПустаяСтрока(СтрокаШаблона) тогда
			ОбщегоНазначенияУХ.СообщитьОбОшибке(СтрШаблон(СтрокаШаблона, РеквизитШаблонаДокумента), Отказ,, СтатусСообщения.Внимание);
		КонецЕсли;
		
		Отказ = Истина;
		
	КонецЕсли;
	
	Если Владелец = Справочники.ТипыБазДанных.ТекущаяИБ Тогда
		
		Согласуется = ПроверитьВозможностьСогласования();
		
		Если Наименование = "ЗаявкаНаИзменениеНСИ"  Тогда
			РеквизитШаблонаДокумента = "СправочникБД";
			ИспользоватьШаблоны = Истина;
			ЗначениеРеквизитаСостоянияНаУтверждении = Перечисления.СостоянияСогласования.НаУтверждении;
			ЗначениеРеквизитаСостоянияУтвержден = Перечисления.СостоянияСогласования.Утверждена;
			ЗначениеРеквизитаСостоянияОтклонен = Перечисления.СостоянияСогласования.Возвращена;
			ЗначениеРеквизитаСостоянияЧерновик = Перечисления.СостоянияСогласования.Черновик;
			РеквизитСостоянияСтрока = "СостоянияСогласования";
			РеквизитСостояния = Справочники.ПеречисленияБД.НайтиПоНаименованию(РеквизитСостоянияСтрока,,,Справочники.ТипыБазДанных.ТекущаяИБ);
		ИначеЕсли Наименование = "НастраиваемыйОтчет" Тогда
			ИспользуетсяВНастройкахРеглмента = Истина;
			РеквизитШаблонаДокумента = "ВидОтчета";
			ИспользоватьШаблоны = Истина;
			ЕстьПравилоРасчета = Истина;
			ЕстьПравилоПроверки = Истина;
			ЕстьБланк = Истина;
			ЕстьСпособФормирования = Истина;
		ИначеЕсли Наименование = "ТрансформационнаяКорректировка" Тогда	
			ИспользуетсяВНастройкахРеглмента = Истина;
			РеквизитШаблонаДокумента = "ШаблонКорректировки";
			ИспользоватьШаблоны = Истина;
			ЕстьПравилоРасчета = Истина;
			ЕстьПравилоПроверки = Истина;
			ЕстьСпособФормирования = Истина;
		ИначеЕсли Наименование = "КорректировкаЗначенийПоказателей" Тогда	
			ИспользуетсяВНастройкахРеглмента = Истина;
			РеквизитШаблонаДокумента = "ШаблонКорректировки";
			ИспользоватьШаблоны = Истина;
			ЕстьПравилоРасчета = Истина;
			ЕстьПравилоПроверки = Истина;
			ЕстьСпособФормирования = Истина;
		ИначеЕсли Наименование = "Трансляция" Тогда
			ИспользуетсяВНастройкахРеглмента = Истина;
			РеквизитШаблонаДокумента = "ШаблонКорректировки";
			ИспользоватьШаблоны = Истина;
			ЕстьПравилоРасчета = Истина;
			ЕстьСпособФормирования = Истина;
			ЕстьШаблонТрансляции = Истина;
			
		ИначеЕсли ЭтоЗаявка() Тогда
			
			ЗначениеРеквизитаСостоянияНаУтверждении = Перечисления.СостоянияСогласования.НаУтверждении;
			ЗначениеРеквизитаСостоянияУтвержден = Перечисления.СостоянияСогласования.Утверждена;
			ЗначениеРеквизитаСостоянияОтклонен = Перечисления.СостоянияСогласования.Возвращена;
			ЗначениеРеквизитаСостоянияЧерновик = Перечисления.СостоянияСогласования.Черновик;
			РеквизитСостоянияСтрока = "СостоянияСогласования";
			РеквизитСостояния = Справочники.ПеречисленияБД.НайтиПоНаименованию(РеквизитСостоянияСтрока,,,Справочники.ТипыБазДанных.ТекущаяИБ);
			
		ИначеЕсли Наименование = "ОперативныйПлан" Тогда
			
			ЗначениеРеквизитаСостоянияНаУтверждении = Перечисления.СостоянияСогласования.НаУтверждении;
			ЗначениеРеквизитаСостоянияУтвержден = Перечисления.СостоянияСогласования.Утверждена;
			ЗначениеРеквизитаСостоянияОтклонен = Перечисления.СостоянияСогласования.Возвращена;
			ЗначениеРеквизитаСостоянияЧерновик = Перечисления.СостоянияСогласования.Черновик;
			РеквизитСостоянияСтрока = "СостоянияСогласования";
			РеквизитСостояния = Справочники.ПеречисленияБД.НайтиПоНаименованию(РеквизитСостоянияСтрока,,,Справочники.ТипыБазДанных.ТекущаяИБ);
			
		ИначеЕсли Наименование = "Резервирование" Тогда
			
			ЗначениеРеквизитаСостоянияНаУтверждении = Перечисления.СостоянияСогласования.НаУтверждении;
			ЗначениеРеквизитаСостоянияУтвержден 	= Перечисления.СостоянияСогласования.Утверждена;
			ЗначениеРеквизитаСостоянияОтклонен 		= Перечисления.СостоянияСогласования.Возвращена;
			ЗначениеРеквизитаСостоянияЧерновик 		= Перечисления.СостоянияСогласования.Черновик;
			РеквизитСостоянияСтрока 				= "СостоянияСогласования";
			РеквизитСостояния = Справочники.ПеречисленияБД.НайтиПоНаименованию(РеквизитСостоянияСтрока,,,Справочники.ТипыБазДанных.ТекущаяИБ);
			
		ИначеЕсли Наименование = "КорректировкаПланов" Тогда
			
			ЗначениеРеквизитаСостоянияНаУтверждении = Перечисления.СостоянияСогласования.НаУтверждении;
			ЗначениеРеквизитаСостоянияУтвержден 	= Перечисления.СостоянияСогласования.Утверждена;
			ЗначениеРеквизитаСостоянияОтклонен 		= Перечисления.СостоянияСогласования.Возвращена;
			ЗначениеРеквизитаСостоянияЧерновик 		= Перечисления.СостоянияСогласования.Черновик;
			РеквизитСостоянияСтрока 				= "СостоянияСогласования";
			РеквизитСостояния = Справочники.ПеречисленияБД.НайтиПоНаименованию(РеквизитСостоянияСтрока,,,Справочники.ТипыБазДанных.ТекущаяИБ);
			
		ИначеЕсли Наименование = "ЗаявкаНаКорректировкуПланов" Тогда
			
			ЗначениеРеквизитаСостоянияНаУтверждении = Перечисления.СостоянияСогласования.НаУтверждении;
			ЗначениеРеквизитаСостоянияУтвержден 	= Перечисления.СостоянияСогласования.Утверждена;
			ЗначениеРеквизитаСостоянияОтклонен 		= Перечисления.СостоянияСогласования.Возвращена;
			ЗначениеРеквизитаСостоянияЧерновик 		= Перечисления.СостоянияСогласования.Черновик;
			РеквизитСостоянияСтрока 				= "СостоянияСогласования";
			РеквизитСостояния = Справочники.ПеречисленияБД.НайтиПоНаименованию(РеквизитСостоянияСтрока,,,Справочники.ТипыБазДанных.ТекущаяИБ);
			
		ИначеЕсли Наименование = "РеестрПлатежей" Тогда
			
			ЗначениеРеквизитаСостоянияНаУтверждении = Перечисления.СостоянияСогласования.НаУтверждении;
			ЗначениеРеквизитаСостоянияУтвержден = Перечисления.СостоянияСогласования.Утверждена;
			ЗначениеРеквизитаСостоянияОтклонен = Перечисления.СостоянияСогласования.Возвращена;
			ЗначениеРеквизитаСостоянияЧерновик = Перечисления.СостоянияСогласования.Черновик;
			РеквизитСостоянияСтрока = "СостоянияСогласования";
			РеквизитСостояния = Справочники.ПеречисленияБД.НайтиПоНаименованию(РеквизитСостоянияСтрока,,,Справочники.ТипыБазДанных.ТекущаяИБ);
			
		ИначеЕсли Наименование = "РакурсДанных" Тогда
			
			РеквизитШаблонаДокумента = "Область";
			ЗначениеРеквизитаСостоянияНаУтверждении = Перечисления.СостоянияОтчетов.Подготовлен;
			ЗначениеРеквизитаСостоянияУтвержден = Перечисления.СостоянияОтчетов.Утвержден;
			ЗначениеРеквизитаСостоянияОтклонен = Перечисления.СостоянияОтчетов.Возвращен;
			ЗначениеРеквизитаСостоянияЧерновик = Перечисления.СостоянияОтчетов.Выполняется;	
			ИспользуетсяВНастройкахРеглмента = Истина;
			РеквизитСостоянияСтрока = "СостоянияОтчетов";
			РеквизитСостояния = Справочники.ПеречисленияБД.НайтиПоНаименованию(РеквизитСостоянияСтрока,,,Справочники.ТипыБазДанных.ТекущаяИБ);
			РеквизитРазделенияПоОрганизациям = "Организация";
			РеквизитРазделенияПоПроектам = "Проект";
			
		ИначеЕсли Наименование = "АккредитацияПоставщика" Тогда
			
			ЗначениеРеквизитаСостоянияНаУтверждении = Перечисления.СостоянияСогласования.НаУтверждении;
			ЗначениеРеквизитаСостоянияУтвержден = Перечисления.СостоянияСогласования.Утверждена;
			ЗначениеРеквизитаСостоянияОтклонен = Перечисления.СостоянияСогласования.Возвращена;
			ЗначениеРеквизитаСостоянияЧерновик = Перечисления.СостоянияСогласования.Черновик;
			РеквизитСостоянияСтрока = "СостоянияСогласования";
			РеквизитСостояния = Справочники.ПеречисленияБД.НайтиПоНаименованию(РеквизитСостоянияСтрока,,,Справочники.ТипыБазДанных.ТекущаяИБ);
			
		ИначеЕсли Наименование = "КвалификацияПоставщика" Тогда
			
			ЗначениеРеквизитаСостоянияНаУтверждении = Перечисления.СостоянияСогласования.НаУтверждении;
			ЗначениеРеквизитаСостоянияУтвержден = Перечисления.СостоянияСогласования.Утверждена;
			ЗначениеРеквизитаСостоянияОтклонен = Перечисления.СостоянияСогласования.Возвращена;
			ЗначениеРеквизитаСостоянияЧерновик = Перечисления.СостоянияСогласования.Черновик;
			РеквизитСостоянияСтрока = "СостоянияСогласования";
			РеквизитСостояния = Справочники.ПеречисленияБД.НайтиПоНаименованию(РеквизитСостоянияСтрока,,,Справочники.ТипыБазДанных.ТекущаяИБ);
			
		ИначеЕсли Наименование = "ЛишениеАккредитации" Тогда
			
			ЗначениеРеквизитаСостоянияНаУтверждении = Перечисления.СостоянияСогласования.НаУтверждении;
			ЗначениеРеквизитаСостоянияУтвержден = Перечисления.СостоянияСогласования.Утверждена;
			ЗначениеРеквизитаСостоянияОтклонен = Перечисления.СостоянияСогласования.Возвращена;
			ЗначениеРеквизитаСостоянияЧерновик = Перечисления.СостоянияСогласования.Черновик;
			РеквизитСостоянияСтрока = "СостоянияСогласования";
			РеквизитСостояния = Справочники.ПеречисленияБД.НайтиПоНаименованию(РеквизитСостоянияСтрока,,,Справочники.ТипыБазДанных.ТекущаяИБ);
			
		ИначеЕсли Наименование = "ОтзывАккредитации" Тогда
			
			ЗначениеРеквизитаСостоянияНаУтверждении = Перечисления.СостоянияСогласования.НаУтверждении;
			ЗначениеРеквизитаСостоянияУтвержден = Перечисления.СостоянияСогласования.Утверждена;
			ЗначениеРеквизитаСостоянияОтклонен = Перечисления.СостоянияСогласования.Возвращена;
			ЗначениеРеквизитаСостоянияЧерновик = Перечисления.СостоянияСогласования.Черновик;
			РеквизитСостоянияСтрока = "СостоянияСогласования";
			РеквизитСостояния = Справочники.ПеречисленияБД.НайтиПоНаименованию(РеквизитСостоянияСтрока,,,Справочники.ТипыБазДанных.ТекущаяИБ);
			
		ИначеЕсли Наименование = "УстановкаОбщихТребованийКПоставщикам" Тогда
			
			ЗначениеРеквизитаСостоянияНаУтверждении = Перечисления.СостоянияСогласования.НаУтверждении;
			ЗначениеРеквизитаСостоянияУтвержден = Перечисления.СостоянияСогласования.Утверждена;
			ЗначениеРеквизитаСостоянияОтклонен = Перечисления.СостоянияСогласования.Возвращена;
			ЗначениеРеквизитаСостоянияЧерновик = Перечисления.СостоянияСогласования.Черновик;
			РеквизитСостоянияСтрока = "СостоянияСогласования";
			РеквизитСостояния = Справочники.ПеречисленияБД.НайтиПоНаименованию(РеквизитСостоянияСтрока,,,Справочники.ТипыБазДанных.ТекущаяИБ);
			
		ИначеЕсли Наименование = "УстановкаТребованийКвалификацииКНоменклатуреПоставщиков" Тогда
			
			ЗначениеРеквизитаСостоянияНаУтверждении = Перечисления.СостоянияСогласования.НаУтверждении;
			ЗначениеРеквизитаСостоянияУтвержден = Перечисления.СостоянияСогласования.Утверждена;
			ЗначениеРеквизитаСостоянияОтклонен = Перечисления.СостоянияСогласования.Возвращена;
			ЗначениеРеквизитаСостоянияЧерновик = Перечисления.СостоянияСогласования.Черновик;
			РеквизитСостоянияСтрока = "СостоянияСогласования";
			РеквизитСостояния = Справочники.ПеречисленияБД.НайтиПоНаименованию(РеквизитСостоянияСтрока,,,Справочники.ТипыБазДанных.ТекущаяИБ);
			
		ИначеЕсли Наименование = "ПредложениеПоставщика" Тогда
			
			ЗначениеРеквизитаСостоянияНаУтверждении = Перечисления.СостоянияСогласования.НаУтверждении;
			ЗначениеРеквизитаСостоянияУтвержден = Перечисления.СостоянияСогласования.Утверждена;
			ЗначениеРеквизитаСостоянияОтклонен = Перечисления.СостоянияСогласования.Возвращена;
			ЗначениеРеквизитаСостоянияЧерновик = Перечисления.СостоянияСогласования.Черновик;
			РеквизитСостоянияСтрока = "СостоянияСогласования";
			РеквизитСостояния = Справочники.ПеречисленияБД.НайтиПоНаименованию(РеквизитСостоянияСтрока,,,Справочники.ТипыБазДанных.ТекущаяИБ);
			
		ИначеЕсли Наименование = "ПоступлениеИнвестиций" Тогда
			
			ЗначениеРеквизитаСостоянияНаУтверждении = Перечисления.СостоянияСогласования.НаУтверждении;
			ЗначениеРеквизитаСостоянияУтвержден = Перечисления.СостоянияСогласования.Утверждена;
			ЗначениеРеквизитаСостоянияОтклонен = Перечисления.СостоянияСогласования.Возвращена;
			ЗначениеРеквизитаСостоянияЧерновик = Перечисления.СостоянияСогласования.Черновик;
			РеквизитСостоянияСтрока = "СостоянияСогласования";
			РеквизитСостояния = Справочники.ПеречисленияБД.НайтиПоНаименованию(РеквизитСостоянияСтрока,,,Справочники.ТипыБазДанных.ТекущаяИБ);
			
		ИначеЕсли Наименование = "ВыбытиеИнвестиций" Тогда
			
			ЗначениеРеквизитаСостоянияНаУтверждении = Перечисления.СостоянияСогласования.НаУтверждении;
			ЗначениеРеквизитаСостоянияУтвержден = Перечисления.СостоянияСогласования.Утверждена;
			ЗначениеРеквизитаСостоянияОтклонен = Перечисления.СостоянияСогласования.Возвращена;
			ЗначениеРеквизитаСостоянияЧерновик = Перечисления.СостоянияСогласования.Черновик;
			РеквизитСостоянияСтрока = "СостоянияСогласования";
			РеквизитСостояния = Справочники.ПеречисленияБД.НайтиПоНаименованию(РеквизитСостоянияСтрока,,,Справочники.ТипыБазДанных.ТекущаяИБ);
			
		ИначеЕсли ИдентификацияПродуктаУХКлиентСервер.ЭтоУправлениеХолдингом() И Наименование = "СтрокаПланаЗакупок" Тогда
			
			НаУтверждении = Перечисления["СтатусыВыгружаемыхОбъектовЕИС"]["НаУтверждении"];
			Утвержден = Перечисления["СтатусыВыгружаемыхОбъектовЕИС"]["Утвержден"];
			Возвращен = Перечисления["СтатусыВыгружаемыхОбъектовЕИС"]["Возвращен"];
			Черновик = Перечисления["СтатусыВыгружаемыхОбъектовЕИС"]["Черновик"];
			
			ЗначениеРеквизитаСостоянияНаУтверждении = НаУтверждении;
			ЗначениеРеквизитаСостоянияУтвержден = Утвержден;
			ЗначениеРеквизитаСостоянияОтклонен = Возвращен;
			ЗначениеРеквизитаСостоянияЧерновик = Черновик;
			РеквизитСостоянияСтрока = "СтатусыВыгружаемыхОбъектовЕИС";
			РеквизитСостояния = Справочники.ПеречисленияБД.НайтиПоНаименованию(РеквизитСостоянияСтрока,,,Справочники.ТипыБазДанных.ТекущаяИБ);
			
		ИначеЕсли Наименование = "ВерсияСоглашенияАккредитив"
			ИЛИ Наименование = "ВерсияСоглашенияБанковскаяГарантия"
			ИЛИ Наименование = "ВерсияСоглашенияВалютноПроцентныйСвоп"
			ИЛИ Наименование = "ВерсияСоглашенияВалютныйСвоп"
			ИЛИ Наименование = "ВерсияСоглашенияВалютныйФорвард"
			ИЛИ Наименование = "ВерсияСоглашенияДепозит"
			ИЛИ Наименование = "ВерсияСоглашенияКоммерческийДоговор"
			ИЛИ Наименование = "ВерсияСоглашенияКредит"
			ИЛИ Наименование = "ВерсияСоглашенияЛизинг"
			ИЛИ Наименование = "ГрафикРасчетовСПокупателемПоставщиком" Тогда
			
			ЗначениеРеквизитаСостоянияНаУтверждении = Перечисления.СостоянияСогласования.НаУтверждении;
			ЗначениеРеквизитаСостоянияУтвержден = Перечисления.СостоянияСогласования.Утверждена;
			ЗначениеРеквизитаСостоянияОтклонен = Перечисления.СостоянияСогласования.Возвращена;
			ЗначениеРеквизитаСостоянияЧерновик = Перечисления.СостоянияСогласования.Черновик;
			РеквизитСостоянияСтрока = "СостоянияСогласования";
			РеквизитСостояния = Справочники.ПеречисленияБД.НайтиПоНаименованию(РеквизитСостоянияСтрока,,,Справочники.ТипыБазДанных.ТекущаяИБ);
		ИначеЕсли Наименование = "ЗаказКлиента" Тогда
			
			ЗначениеРеквизитаСостоянияНаУтверждении = Перечисления.СостоянияСогласования.НаУтверждении;
			ЗначениеРеквизитаСостоянияУтвержден = Перечисления.СостоянияСогласования.Утверждена;
			ЗначениеРеквизитаСостоянияОтклонен = Перечисления.СостоянияСогласования.Возвращена;
			ЗначениеРеквизитаСостоянияЧерновик = Перечисления.СостоянияСогласования.Черновик;
			РеквизитСостоянияСтрока = "СостоянияСогласования";
			РеквизитСостояния = Справочники.ПеречисленияБД.НайтиПоНаименованию(РеквизитСостоянияСтрока,,,Справочники.ТипыБазДанных.ТекущаяИБ);
			
		ИначеЕсли Наименование = "ПокрытиеПотребностиВФинансировании" Тогда
			
			ЗначениеРеквизитаСостоянияНаУтверждении = Перечисления.СостоянияСогласования.НаУтверждении;
			ЗначениеРеквизитаСостоянияУтвержден 	= Перечисления.СостоянияСогласования.Утверждена;
			ЗначениеРеквизитаСостоянияОтклонен 		= Перечисления.СостоянияСогласования.Возвращена;
			ЗначениеРеквизитаСостоянияЧерновик 	= Перечисления.СостоянияСогласования.Черновик;
			РеквизитСостоянияСтрока 			= "СостоянияСогласования";
			РеквизитСостояния 					= Справочники.ПеречисленияБД.НайтиПоНаименованию(РеквизитСостоянияСтрока,,,Справочники.ТипыБазДанных.ТекущаяИБ);    
			
		ИначеЕсли Наименование = "ЗаявкаНаПривлечениеФинансирования" Тогда
			
			ЗначениеРеквизитаСостоянияНаУтверждении = Перечисления.СостоянияСогласования.НаУтверждении;
			ЗначениеРеквизитаСостоянияУтвержден 	= Перечисления.СостоянияСогласования.Утверждена;
			ЗначениеРеквизитаСостоянияОтклонен 		= Перечисления.СостоянияСогласования.Возвращена;
			ЗначениеРеквизитаСостоянияЧерновик 	= Перечисления.СостоянияСогласования.Черновик;
			РеквизитСостоянияСтрока 			= "СостоянияСогласования";
			РеквизитСостояния 					= Справочники.ПеречисленияБД.НайтиПоНаименованию(РеквизитСостоянияСтрока,,,Справочники.ТипыБазДанных.ТекущаяИБ);	
			
		ИначеЕсли Наименование = "Лот" Тогда
			
			ЗначениеРеквизитаСостоянияНаУтверждении = Перечисления.СостоянияСогласования.НаУтверждении;
			ЗначениеРеквизитаСостоянияУтвержден = Перечисления.СостоянияСогласования.Утверждена;
			ЗначениеРеквизитаСостоянияОтклонен = Перечисления.СостоянияСогласования.Возвращена;
			ЗначениеРеквизитаСостоянияЧерновик = Перечисления.СостоянияСогласования.Черновик;
			РеквизитСостоянияСтрока = "СостоянияСогласования";
			РеквизитСостояния = Справочники.ПеречисленияБД.НайтиПоНаименованию(РеквизитСостоянияСтрока,,,Справочники.ТипыБазДанных.ТекущаяИБ);
			
		ИначеЕсли Наименование = "ПротоколВыбораПобедителей" Тогда
			
			ЗначениеРеквизитаСостоянияНаУтверждении = Перечисления.СостоянияСогласования.НаУтверждении;
			ЗначениеРеквизитаСостоянияУтвержден = Перечисления.СостоянияСогласования.Утверждена;
			ЗначениеРеквизитаСостоянияОтклонен = Перечисления.СостоянияСогласования.Возвращена;
			ЗначениеРеквизитаСостоянияЧерновик = Перечисления.СостоянияСогласования.Черновик;
			РеквизитСостоянияСтрока = "СостоянияСогласования";
			РеквизитРазделенияПоОрганизациям = "ОрганизаторЗакупки";
			РеквизитСостояния = Справочники.ПеречисленияБД.НайтиПоНаименованию(РеквизитСостоянияСтрока,,,Справочники.ТипыБазДанных.ТекущаяИБ);
			
		КонецЕсли;
		
		Если РасширениеБизнесЛогикиУХ.ЭтоДокументПроцессаПодготовкиОтчетности(Наименование) Тогда
			
			ИспользуетсяВПроцессе = Истина;
			
			ЗначениеРеквизитаСостоянияНаУтверждении = Перечисления.СостоянияОтчетов.Подготовлен;
			ЗначениеРеквизитаСостоянияУтвержден = Перечисления.СостоянияОтчетов.Утвержден;
			ЗначениеРеквизитаСостоянияОтклонен = Перечисления.СостоянияОтчетов.Возвращен;
			ЗначениеРеквизитаСостоянияЧерновик = Перечисления.СостоянияОтчетов.Выполняется;
			РеквизитСостояния = Справочники.ПеречисленияБД.НайтиПоНаименованию("СостоянияОтчетов",,,Справочники.ТипыБазДанных.ТекущаяИБ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Заполнение реквизита разделение по организациям по умолчанию.
	Если НЕ ЗначениеЗаполнено(РеквизитРазделенияПоОрганизациям) Тогда
		Если ЭтоЗаявка() Тогда
			РеквизитРазделенияПоОрганизациям = "Организация";
		ИначеЕсли Наименование = "НастраиваемыйОтчет" Тогда
			РеквизитРазделенияПоОрганизациям = "Организация";
		Иначе
			СтруктураОтбора = Новый Структура();
			СтруктураОтбора.Вставить("Имя", "Организация");
			НайденныеСтроки = Реквизиты.НайтиСтроки(СтруктураОтбора);
			Если НайденныеСтроки.Количество() > 0 Тогда
				РеквизитРазделенияПоОрганизациям = "Организация";
			Иначе
				СтруктураОтбора.Вставить("Имя", "ЦФО");
				НайденныеСтроки = Реквизиты.НайтиСтроки(СтруктураОтбора);
				Если НайденныеСтроки.Количество() > 0 Тогда
					РеквизитРазделенияПоОрганизациям = "ЦФО";
				Иначе
					РеквизитРазделенияПоОрганизациям = "";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция Использование77() Экспорт
	
	Если Используется77 = Неопределено Тогда
		Используется77 = (Владелец.ВерсияПлатформы = Перечисления.ПлатформыВнешнихИнформационныхБаз.Предприятие77);	
	КонецЕсли;
	
	Возврат Используется77;
	
КонецФункции

Функция ПроверитьВозможностьСогласования() Экспорт
	
	Если НЕ Владелец=Справочники.ТипыБазДанных.ТекущаяИБ Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Для Каждого ОТип Из Метаданные.ОпределяемыеТипы.ОбъектыДляСогласования.Тип.Типы() Цикл
		Если Метаданные.Документы.Найти(Наименование) <> Неопределено Тогда
			Если ОТип=Тип("ДокументСсылка."+Наименование) Тогда
				Возврат Истина;
			КонецЕсли;
		Иначе
			ТекстСообщения = НСтр("ru = 'Не найден документ %Наименование%. Возможно, требуется обновить данные по метаданным текущей ИБ.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Наименование%", Строка(Наименование));
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения, , , СтатусСообщения.Информация);
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции	

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Функция ЭтоЗаявка()
	
	Возврат Наименование = "ЗаявкаНаРасходованиеДенежныхСредств" Или Наименование = "ОжидаемоеПоступлениеДенежныхСредств"
	Или Наименование = "ЗаявкаНаРасход" Или Наименование = "ПланируемыйДоход";
	
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	// Заполнение параметров согласования по умолчанию.
	РеквизитСостояния = Справочники.ПеречисленияБД.НайтиПоНаименованию("СостоянияСогласования", , , Справочники.ТипыБазДанных.ТекущаяИБ);
	ЗначениеРеквизитаСостоянияНаУтверждении	 = Перечисления.СостоянияСогласования.НаУтверждении;
	ЗначениеРеквизитаСостоянияОтклонен		 = Перечисления.СостоянияСогласования.Возвращена;	
	ЗначениеРеквизитаСостоянияУтвержден		 = Перечисления.СостоянияСогласования.Утверждена;
	ЗначениеРеквизитаСостоянияЧерновик		 = Перечисления.СостоянияСогласования.Черновик;
КонецПроцедуры

#КонецЕсли
